public/blog/posts/how.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-26 Thu 20:06 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Morgan Kothman</title>
<meta name="author" content="Morgan Kothman">
<meta name="description" content="Morgan is a tech support specialist in Michigan,
focusing on making technology more accessible for the
average person.">
<meta name="keywords" content="Morgan Kothman, tech support, tech support specialist, tech accessibility">
<meta name="generator" content="Org Mode">
<link rel="stylesheet" href="https://kothman.github.io/styles.css?busted=1750982799"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap-icons@1.11.3/font/bootstrap-icons.min.css">
</head>
<body>
<div id="preamble" class="status">
<header><nav><ul><li><a href="https://kothman.github.io"><h1>Morgan Kothman</h1><h3>tech support for the people</h3></a><li id="nav-home"><a href="https://kothman.github.io/">home</a></li><li id="nav-resume"><a href="https://kothman.github.io/resume/">resume</a></li><li id="nav-blog"><a href="https://kothman.github.io/blog/">blog</a></li><li id="nav-contact"><a href="mailto:mari.morcant@gmail.com">mari.morcant@gmail.com</a></li></ul></nav></header>
</div>
<div id="content" class="content">
<div id="content-subcontainer" class="content-subcontainer">
<div id="outline-container-orge420987" class="outline-1">
<h1 id="orge420987">Using LaTex to Create my Resume</h1>
<div class="outline-text-1" id="text-orge420987">
<p>
<div class="timestamp-pull-left">
<span class="timestamp-wrapper"><span class="timestamp">Saturday, November 23, 2024</span></span>
</div>
</p>
</div>
<div id="outline-container-org5cee342" class="outline-2">
<h2 id="org5cee342">Or, How I produce a PDF and webpage from a single text file.</h2>
<div class="outline-text-2" id="text-org5cee342">
<p>
Have you ever thought to yourself, "I wish there was a more
complicated way to make a resume"?
</p>

<p>
Jokes aside, I recently decided to streamline the creation of my
website and resume into a single workflow. Using Emacs, Org-Mode, and
LaTex, I can store and edit my information in Org files (a note-taking format
for text files) which then get automatically published upon saving.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer><span>made with <a href="https://www.gnu.org/software/emacs/" target="_blank">emacs</a>, <a href="https://orgmode.org/" target="_blank">org-mode</a>, and persistence</span><br><a target="_blank" href="https://validator.w3.org/check?uri=https://kothman.github.io">w3c validation</a></footer>
</div>
</body>
</html>
